Repository: khalid-hussain/hundred-hanbali-questions
Catalog: hundred-hanbali-questions-level2.tmx
Source language: ar_sa
Languages: en_gb

source: انظر: الفروع (1\202).
en_gb: See _al-Furūʿ_ (1/202).

source: انظر: المنح الشافيات (1\158--160).
en_gb: See _al-Manḥ al-Shāfiyāt_ (1/158--160).

source: انظر: حاشية الروض المربع (1\278--279).
en_gb: See _Ḥāshiyah al-Rawḍ al-Murbiʿ_ (1/278--279).

source: انظر: حاشية الروض المربع (1\280).
en_gb: See _Ḥashiyah al-Rawḍ al-Murbiʿ_ (1/280).

source: انظر: كشاف القناع (1/33-34).] وَاجِبٌ.
en_gb: See _Kashāf al-Qināʿ_ (vol. 1, pp. 33--34).] is _wājib_.

source: انظر: كشاف القناع (1/54--55).
en_gb: See _Kashāf al-Qināʿ_ (vol. 1, pp. 54--55).

source: انظر: كشاف القناع (1\151–152).
en_gb: See _Kashāf al-Qināʿ_ (vol. 1, pp. 151--152).

source: انظر: منار السبيل (1\34).
en_gb: See _Manār al-Sabīl_ (1/34).

source: انظر: منار السبيل (4\45).
en_gb: See _Manār al-Sabīl_ (4/45).

source: انقطاعُ ما يوجِبُهُ من بَوْلٍ وريحٍ وَحَیْضٍ وَنِفَاسٍ ونحوِ ذلكَ.
en_gb: To be free from all that obligates it such as urinating, passing wind, menstruation, postpartum bleeding, etc.

source: بتراب.
en_gb: be with dirt

source: بشرطِ:
en_gb: With the following conditions:

source: تخليلُ اللحيةِ الكثيفةِ.
en_gb: And to run one's fingers through their thick beard.

source: ثم الحَدَثُ قِسْمَانِ:
en_gb: Spiritual impurities are of two kinds:

source: ثم زاد عليه سُنيّةَ قراءةِ سورةِ القَدْرِ.
en_gb: He has added the recitation of Surah al-Qadr to the _sunan_ of _wuḍūʾ_.

source: ثم يتمضمضُ، ويستنشقُ ثلاثًا ثلاثًا.
en_gb: And then to perform _maḍmaḍah_ and _istinshāq_ thrice each.

source: ثم يغسلُ وجهَهُ ثلاثًا من منبتِ شَعْرِ الرَّأْسِ المُعْتَادِ إلى مُنْتَهىٰ الذَّقنِ طولًا، ومن الأُذُنِ إلى الأُذُنِ عَرْضًا.
en_gb: Then to wash the face thrice from the beginning of the hairline at the forehead to the end of chin lengthwise and from one ear to the other widthwise.

source: ثم يغسلُ يديهِ مع مِرْفَقَيْهِ ثلاثًا.
en_gb: Then to wash the hands until the elbows thrice.

source: ثم يقولُ: بسم الله.
en_gb: And then to say, “bismillāh.”

source: ثم يمسحُ جميعَ ظاهرِ رَأْسِهِ، يُمِرُّ يَدَيْهِ مِنْ مُقَدَّمِهِ إلى قفاه، ويعيدُهُما.
en_gb: And then to wipe all of the (apparent/external) head by passing both hands from the front of the head to its back, and then back again.

source: ثم يَغْسِلُ رجليه مع كعبيهِ ثلاثًا.
en_gb: Then to wash the feet upto the ankle thrice.

source: ج: إذا كانتِ النجاسةُ من الكلبِ والخنزيرِ وما تولَّد منهما أَوْ مِنْ أَحَدِهِمَا يُغَسل المتنجسُ سبعَ مراتٍ إحداهنّ بترابٍ طَهور[^ف1].
en_gb: If the _najāsah_ is from a dog or a pig or from what they give birth to (same species), or what one of them gives birth to (cross-species), the object with _najāsah_ is cleaned seven times, with one of the times being with _ṭahūr_ earth.[^fn-1]

source: ج: شروط صحة التيمم ثمانية، وهي:
en_gb: The conditions for the validity of tayammum are eight (8). They are:

source: ج: فروضه خمسة، وهي:
en_gb: Its farḍ ‹actions› are five (5). They are:

source: ج: كلُّ خارجٍ مِنهُ نجس، إِلَّا مني الآدمي ولبنُهُ فطاهرٌ.
en_gb: All excrement from it is _najas_ except for human sperm and milk, for they are _ṭāhir_ (pure).

source: ج: ما أُكِلَ لحمُه: فَبَوْلُهُ وَرَوْثُهُ، وكل خارج منه طاهرٌ[^ف4]/، إِلَّا الدَمَ والقيحَ، لكن يعفى عن يسيره في الصّلاة.
en_gb: Whatever [animal] whose meat is eaten, then its urine and stool, and whatever is excreted from it is _ṭāhir_ (pure)[^fn-4] except blood and pus; however a small amount is (overlooked/ forgiven/ excused) in Ṣalāh.

source: ج: ما لا يؤكلُ لحمُهُ من الطير والبهائمِ مما فوق الهرة نَجِس.
en_gb: Birds and cattle whose meat is not eaten and which are bigger than a cat are _najas_.

source: ج: مُبْطَلاتُهُ خَمْسَةٌ، وهِي:
en_gb: Things which make it void are five (5). They are:

source: ج: يجب فيه التسمية وتسقط سهوا وجهلا، لا عمدة.
en_gb: The _tasmiyah_ (i.e. saying the _basmalah_) is obligatory for it. ‹Its obligation› is dropped due to forgetfulness or ignorance; not intentionally.

source: حَلْقُ العَانَةِ.
en_gb: To (trim/cut) pubic hair

source: دخول وقت الصلاة المتيمم لها.
en_gb: The entrance of the time of prayer for which one has done tayammum

source: ذكرها السامريُّ في المستوعب (1\169) قال : «ثم يقرأ سورة القدر ثلاث مرات»!
en_gb: Al-Sāmurī mentioned it in _al-Mustawʿib_ (1/169) and said, “Then recite Sūrah al-Qadr three times.”

source: رواه سعید بن منصور في سننه (رقم: 646) كما يجوز للجنب والحائض والنفساء العبور من المسجد لحاجة أو غيرها.
en_gb: It was reported by Saʿīd ibn Manṣūr in his Sunan (#646). Similarly, it is allowed for a Junub, a menstruating woman, and a woman with post-partum bleeding to pass through a masjid due to a need or other than it.

source: عندَ وضوءٍ.
en_gb: During Wuḍūʾ

source: غير مستعمل.
en_gb: that was not previously used ‹for tayammum›

source: غَسْلُ الوَجْهِ، وَمِنْهُ: المضمضةُ والاستنشاقُ.
en_gb: The washing of the face which includes (al-Madmadah) and (al-Istinshaq).

source: فإن أمكنه نزعها ثم ربطها بعد الطهارة فَعل، وإلّا فيتوضأ ويتيمم ولا يمسح عليها، سواء تجاوزت موضع الحاجة أو لا.
en_gb: If possible, it should be removed and then put back on after performing _wuḍūʾ_. Otherwise, _wuḍūʾ_ and _tayammum_ should be performed, irrespective if the (splint) exceeds the wounded area or not.

source: فإنه يستحب له التيمم بدلًا عن الغُسل - والله أعلم.
en_gb: In such cases, _tayammum_ is _mustaḥab_ instead of _ghusl_. Allāh knows best.

source: قال الشارح (1\90): «وهو قول جابر بن سمرة، ومحمد بن إسحٰق، وأبي خيثمة، ويحيىٰ بن يحيىٰ، وابن المنذر وأحد قولي الشافعي، وقال الخطابي: ذهب إلى هذا عامة أصحاب الحديث.» ا.هـ.
en_gb: The Shāriḥ said, “This is the opinion of Jābir ibn Samurah, Muḥammad ibn Isḥāq, Abū Khay′thamah, Yaḥyá ibn Yaḥyá, Ibn Mundhir, and one of the two opinions of Imam al-Shāfiʿī. Al-Khaṭṭābī said, ‘This is the opinion of most of the People of Ḥadīth.’” (1/90)

source: قال: أصلي في مرابض الإبل؟ قال: لا.» رواه أحمد (5\98) ومسلم (360) وغيرهما.
en_gb: (The man) said, “Can I pray in camel pens?” He replied, «Yes.»

source: قال: أصلي في مرابض الغنم؟ قال: نعم.
en_gb: (The man) said, “Can I pray in sheepfolds?” He replied, «Yes.»

source: قال: أنتوضأ من لحوم الإبل؟ قال: نعم توضأ من لحوم الإبل.
en_gb: (The man) said, “Do we make _wuḍūʾ_ due to (consuming) camel (meat)?” He replied, «Yes. Make _wuḍūʾ_ due to (consuming) camel (meat).»

source: قراءةُ القرآنِ.[^ف2]
en_gb: Reciting the Quran[^fn-2]

source: لكن يكره اتخاذ المسجد طريقًا -- كما نص عليه الإمام أحمد -- بل منع شيخ الإسلام ابن تيمية من اتخاذه طريقًا احترامًا لبيوت الله.
en_gb: However, it is disliked to take masājid as pathways -- as is reported verbatim from Imam Aḥmad -- Shaykh al-Islām Ibn Taymīyah even forbade those who take (masājid) as pathways out of reverence for the Houses of Allāh FSWT.

source: له غبار يعلق باليد.
en_gb: and that has dust which clings to the hands

source: لُبْسهما بعد كمالِ الطّهارةِ بالماءِ.
en_gb: They are worn after being in a state of complete purification

source: ما أبطلَ الوضوءَ.
en_gb: Everything that nullifies wuḍūʾ.

source: ما أوجبَ الغُسْلَ.
en_gb: What necessitates _ghusl_.

source: مباح.
en_gb: that is permissible

source: مسح الوجه دون الفم.
en_gb: Wiping the face with the exception of the lips.

source: ميتة الآدمي.
en_gb: The human corpse.

source: هذا هو المذهب، واختار شيخ الإسلام ابن تيمية (رحمه الله تعالى) أن الجبيرة يمسح عليها مطلقًا، سواء شَدّها على طهارة أو على حدث، وسواء جاوزت المحل أو لا، ولا يشترط التيمم عليها بحال، وهو الصواب.
en_gb: This is the [official position of the] _madhhab_. Shaykh al-Islām Ibn Taymīyyah \FM_HIM opined that orthoses should be wiped over unconditionally, irrespective if put on in a state of purity or not, and irrespective if only the wounded area is covered or not. _Tayammum_ is not required in any case. And this seems to be what is correct.

source: و على المحدِثِ حَدَثًا أكبرَ:
en_gb: ...and upon one who's impurity is _asghar_:

source: وأخذُ ماءٍ جديدٍ للأُذنينِ.
en_gb: And to take another round of water for the ears.

source: وأكلُ لحم الإبِلِ ولو نيئًا.[^ف1]
en_gb: Consumption of camel meat even if raw.[^fn-1]

source: وأما الشعرُ والصُّوفُ والرِّيشُ فَطَاهِرٌ، إِنْ كانَ مِنْ حَيَوَانِ طاهرٍ في الحياةِ، وإِنْ لم يكنْ مَأكُولًا كالهِرَّةِ.
en_gb: As for the hair, wool (fur), and feathers then it's pure if the animal is considered pure if alive, even if it's _ḥarām_ to eat, like cats.

source: وأن يتولى وضوءه بنفسه.[^ف2]
en_gb: To perform the ablution by one's self (i.e. without the assistance of someone else)[^fn2]

source: وأن يكو:
en_gb: And that it (tayammum):

source: وأَصْغَرُ: وهو ما أَوْجَبَ الوُضُوءَ.
en_gb: _Aṣghar_: That which necessitates _Wuḍū_.

source: وأَعْظَمُهَا: أنَّهُ يُذَكِّرُ الشَّهَادَةَ عِنْدَ الموتِ.
en_gb: And most importantly, it reminds a dying person of the testimony of faith

source: وأَنْ يقضيَ حاجتَهُ في طريقٍ مَسْلوكٍ.
en_gb: To relieve oneself on trodden pathways.

source: وأَنْ يلبثَ فوقَ حاجتِهِ.
en_gb: and to stay longer than is necessary.

source: وإباحتُهُمَا.
en_gb: They are permissible to use (not stolen, etc.)

source: وإزالةُ ما على الفَرْجِ والبَدَنِ مِنْ منيٍّ ونجاسةٍ.
en_gb: Removing what is on the private part and the body of manī (pre-ejaculatory fluid) and _najāsah_.

source: وإزالةُ ما يمنعُ وُصولُ الماءِ إِلى الجَسَد.[^ف3]
en_gb: Removal of what prevents water from reaching the skin.[^fn3]

source: وإزالةُ ما يمنعُ وُصُولَ الماءِ من شَمْعٍ أَوْ عَجِيْنٍ أَوْ نَحْوِهِمَا.
en_gb: Removal of anything that prevents water from reaching (the skin) such as wax, dough, and so on.

source: وإسلام الكافرِ، ولو مرتدًّا.
en_gb: Entering Islam for a kāfir, even if an apostate

source: وإطالةِ سكوتٍ.
en_gb: After prolonged silence

source: وإعادةُ غَسْل رجليه بمكانٍ آخرَ.
en_gb: Washing one's feet once more in a separate place.

source: وإعفاءُ اللِّحْيَةِ.
en_gb: Let the beard grow

source: وإغماءٍ.
en_gb: And [upon coming out of] unconsciousness.

source: وإفراغُ الماءِ على رأسِهِ ثلاثًا، وَعلى بقية بَدَنِهِ ثلاثًا.
en_gb: Pouring water over one's head three times, and over the rest of one's body three times.

source: وإما أن لا تتجاوز محل الحاجة، فإنه يغسلُ الجزء الصحيح ويمسحُ على الجزء المجبور بلا تیمم.
en_gb: If it doesn't exceed the wounded area, he would wash the healthy parts and wipe over the wounded area without performing _tayammum_.

source: وإمرارُ اليد على الجَسَدِ.
en_gb: Passing one's hands over the body.

source: وإمكانُ المشي بهما عُرفًا.
en_gb: It's possible to walk around in them (customarily)

source: وإن تجاوزت وخيف الضررُ بنزعها، وَجَب مع المسح التيممُ للزائدِ.
en_gb: But if it exceeds [the wounded area] and there is fear of harm in its removal, then _tayammum_ is also obligated along with wiping for the excess area.

source: وإنْ كانت من غير ذلك، يُغسل سبعًا بِالماءِ فقط[^ف2].
en_gb: If it is from other than these two, then it is washed seven times with water only[^fn-2].

source: وإِنْ وضَعها علىٰ غير طهارةٍ غَسَل الصحيحَ، وتيمم بلا مِسحٍ تجاوزت أم لا.
en_gb: If not put on in a state of purity, the healthy parts should be washed and _tayammum_ should be performed, without wiping the orthosis, irrespective if it covers more than the wounded area or not.

source: واستسقاءٍ.
en_gb: And [for] the istisqāʾ [prayer] (prayer for asking for rain).

source: واستصحابُ النيةِ إلى آخرِ الوضوءِ.
en_gb: To maintain the intention until the end of Wuḍūʾ.

source: والأفضلُ: أن يستجمرَ أولًا بالأَحجارِ ثم يُتْبعُها بالماءِ.
en_gb: It's preferable to do _istijmār_ with stones first then follow it up with water.

source: والإتيانُ بالنيةِ عند غسْلِ الكفينِ.
en_gb: To realize the intention when washing the hands.

source: والإسلام.
en_gb: Islam

source: والإسلامُ.
en_gb: Islam

source: والاستنجاء أو الاستجمار.
en_gb: _Istinjāʾ_ or _Istijmār_

source: والاستنجاءُ أو الاستجمارُ.
en_gb: _Istinjāʾ_ or _Istijmār_

source: والاكتحالُ كلَّ ليلةٍ.
en_gb: Apply _kohl_ nightly

source: والبولُ في إنَاءٍ بلا حاجةٍ.
en_gb: Urinate in a container without need.

source: والبُداءَة بالمضمضةِ والاستنشاقِ قبل غَسْلِ الوجْهِ.
en_gb: Starting with _maḍmaḍah_ and _istinshāq_ before washing of the face.

source: والترتيب.
en_gb: Order.

source: والتمييز.
en_gb: Tamyīz (discernment)

source: والتمييزُ.
en_gb: Tamyīz

source: والتمييزُ، أي: بلوغ سَبْعِ سِنِيْنَ.
en_gb: To be able to distinguish, i.e. has reached seven (hijrī) years of age.

source: والتيامنُ.
en_gb: Starting with the right.

source: والتَّرْتِيْبُ بَيْنَ الأعضاءِ.
en_gb: The order of washing the limbs.

source: والجراد.
en_gb: Locusts.

source: والجلوسُ في المسجدِ بلا وُضُوءٍ.[^ف3]
en_gb: Staying in a masjid without (performing) _wuḍūʾ_[^fn-3]

source: والحيضُ.
en_gb: Menstruation

source: والردَّةُ عن الإسلامِ (والعياذُ بالله تعالى).
en_gb: Apostasy from Islam (Refuge with Allāh is sought).

source: والزيادةُ في ماءِ الوجهِ.
en_gb: (XXX And to increase in water for the face?)

source: والسمكُ.
en_gb: Samak (usually translated as _fish_).

source: والسواكُ.
en_gb: Using the _siwāk_

source: والطوافُ.
en_gb: Ṭawāf

source: والعقل.
en_gb: A sound mind

source: والعقلُ.
en_gb: A sound mind

source: والغَسلةُ الثانيةُ والثالثةُ.
en_gb: And the second and third washings.

source: والغُسْلُ لأجلِ غُسل میتٍ.
en_gb: _Ghusl_ for one who did _ghusl_ for a dead person.

source: والفرق: أن استعمال الجلد في المائع يفضي إلى تعدي النجاسة، خلافًا لليابس.
en_gb: The difference: the usage of the tanned skin for liquids might result in exceeding of the impurity unlike its usage for dry stuff.

source: والكثيرُ:[^ها-2] ما بلغَ قُلَّتَيْنِ فَأَكْثَرَ.[^ها-3] وهما: أحدٌ وسبعونَ رِطْلًا وثلاثةُ أَسْبَاعِ رِطْلٍ بِالنَّابُلُسيِّ وما وَافَقَهُ.
en_gb: And _kathīr_ [^fn-2] is that which reaches _qullatayn_ or greater.[^fn-3] _Qullatayn_ is seventy-one (71) and three-sevenths (3/7) _riṭl_ in Nablus (Palestine) or whatever equals it.

source: والكلامُ.
en_gb: Speak.

source: والله أعلم.
en_gb: And Allāh knows best.

source: والماءُ الطهورُ المباحُ.
en_gb: Permissible _ṭahūr_ water

source: والماءُ الطهورُ المُبَاحُ.
en_gb: Water that is _ṭahūr_ and permissible.

source: والمبالغةُ في سائرِ الأَعْضَاءِ.
en_gb: And to exaggerate in the rest of the limbs.

source: والمبالغةُ فيهما لغيرِ الصائمِ.
en_gb: And to exaggerate in that for the non-fasting person.

source: والموالاة في الطهارة الصغرى.[^ف1]
en_gb: Al-Muwālah in _ṭahārah sugrá_ (minor purification).[^fn1]

source: والموالاةُ.
en_gb: (Doing it in order?)

source: والموالاةُ، وَهِيَ: أَنْ لا يُؤَخِّرَ غَسْلَ عُضْوٍ إلىٰ أَنْ يَجِفَّ ما قبلَهُ بزَمَنٍ معتدلٍ.
en_gb: Continuity and it is to not delay the washing of limb until one fears that (the time period is separated).

source: والموت، تَعَبُّدًا.[^ف2]
en_gb: Death, _taʿabbudan_[^fn2]

source: والنطقُ بها سرًا.
en_gb: (And pronouncing it silently?)

source: والنظرُ في المِرآةِ.
en_gb: Look in the mirror

source: والنفاسُ.
en_gb: Post-partum bleeding

source: والنيةُ.
en_gb: Intention

source: وانتباهٍ من نومٍ.
en_gb: When one wakes up from sleep

source: وانظر: حاشية «الروض المربع» (1/436--437).
en_gb: See _Ḥāshiyah al-Rawḍ al-Murbiʿ_ (1/436--437).

source: وبالحجرِ: أنْ يبقىٰ أَثَرٌ لا يزيلُهُ إِلَّا الماءُ.
en_gb: With stones: (in this case) traces (of _najāsah_) might remain which can only be lifted with water.

source: وتحت شجرةٍ مُثْمِرةٍ.
en_gb: and (To relieve oneself) under a tree that has bore fruit.

source: وتخليلُ أصابعِ اليدينِ والرِّجْلَيْنِ.
en_gb: And to run one's fingers through both hands and feet.

source: وتسقط سهوا وجهلا، لا عمدة.
en_gb: ‹Its obligation› is dropped due to forgetfulness or ignorance; not intentionally.

source: وتسقطُ سهوًا وجهلًا، لا عمدًا.
en_gb: \[However\] it is waived due to forgetting or not knowing, but not intentionally.

source: وتطهُرُ أرض ونحوُهَا بِإِزَالَةِ عينِ النَّجَاسَةِ بِالماءِ.
en_gb: For the purification of the ground and similar, [it is sufficient] to remove the actual _najāsah_ with water.

source: وتعيين النية لما يتمم له، من حدث أصغر، أو أكبر، أو من نجاسة على البدن.
en_gb: Specifying the intention for what one wants to do tayammum for: from ḥadath asghar, ḥadath akbar, or from physical impurity on the body.

source: وتغيُّرِ رائحةِ فمٍ.
en_gb: When the smell of mouth changes

source: وتقديمُ اليمنىٰ على اليُسرىٰ مِنَ اليدينِ والرِّجلَيْنِ.
en_gb: And to wash the right hand before the left hand and the right leg before the left leg.

source: وثبوتُهُما بنفْسِهِمَا.
en_gb: They are attached to the foot on their own

source: وجه الدلالة: أن النبي ﷺ أمرهم بشرب أبوال الإبل، والنجس لا يباح شربه، حتى لو أبيح للضرورة لأمرهم بغسل أثره لأجلِ الصلاة وإلا لزم تأخير البيان عن وقت الحاجة.
en_gb: The evidence lies in the fact that the Prophet \FPBUH commanded them to drink the urine of camels; _najāsah_ is not permissible to drink. But even if it were to become permissible due to pressing need, he would have commanded them to wash off its remnants for _ṣalāh_. Otherwise, it would entail delaying clarification at the time of need, [i.e. The Prophet \FPBUH would not delay this clarification if it was needed].

source: وحجمهما : إناءٌ مكعبٌ طول ضِلْعه ذراع وربع، والذراع (54) سم تقريبًا.
en_gb: Its volume [is like that of] a cube-shaped container whose sides are 1.25\ cubits long. A cubit is approximately 54\ cm.

source: وحَفُّ الشَّاربِ.
en_gb: Trim the mustache

source: وخروجُ النجاسةِ من بقية البَدَنِ، فَإِنْ كان الخارجُ بولًا أو غائطًا نقضَ مطلقًا وإِنْ كان غيرهما كالدَّمِ والقيءِ، نقض إِنْ كثُر عند كُلّ أحدٍ بحسب نفسِهِ.
en_gb: The exit of _najāsah_ from any other part of the body. If what exits is urine or stool (feces), it nullifies absolutely. If other than these two such as blood and vomit, it nullfies if in large amounts according to each one's personal estimation.

source: وخروجُهُ من مَخْرِجِهِ المُعْتَادِ بِلذَّةٍ، فَإِنْ خَرَجَ لغيرِ ذلكَ لم يُوجب الغُسْلَ.
en_gb: Its ‹i.e. semen› exit from its place accompanied by desire. If it exits without it ‹i.e. without desire›, then it doesn't obligate _ghusl_.

source: وخلعُ نحوِ الخفِ إن تيمَّم وهو لابسُه.
en_gb: Removal of the likes of a khuff if one made tayammum while wearing it.

source: وخُرُوجُ الوقتِ.
en_gb: Exit of the ‹prayer› time.

source: وخُلوِّ مَعِدَةٍ منْ طعامٍ.
en_gb: On an empty stomach

source: ودخولِ مسجدٍ.
en_gb: When entering a Masjid

source: وذلكَ^[أي: غَسْلُ يد القائم من نوم الليل واجب، ويحتمل أن تكون الإشارة راجعة إلى النية والتسمية، وكلا الاحتمالين صحيح.
en_gb: And this^[i.e. the washing of the hands of someone who wakes from sleep. However, it could also refer to the intention and saying of the _Basmalah_. Both possibilities are correct.

source: ورَمَادٍ.
en_gb: Urinate on ashes.

source: وزنهما: (۲۰۰) كيلوغرام تقريبًا.
en_gb: Its weight is approximately 200 kilograms.

source: وزوالُ العقلِ بجنونٍ، أو تغطيتُه بنحوِ نومٍ، ما لم يكن يسيرًا عُرْفًا من جالسٍ متمكّن أَوْ قائمٍ.
en_gb: Loss of intellect due to madness, or its unconsciousness due to sleep and suchlike with what is not customarily (considered) light from both one sitting (firmly?) or standing.

source: وزوالُ العُذْرِ المُبيحِ.
en_gb: Cessation of the excuse that permitted ‹tayammum in the first place›

source: وسترُهُمَا لمحلِّ الفَرْضِ.
en_gb: They cover the area which is obligatory to wash during ablution

source: وشرعًا: ارتفاعُ الحدثِ وَزوال الخَبَثِ.
en_gb: Technically, it means the lifting of _ḥadath_ (spiritual impurity) and removal of _khabath_ (physical impurity).

source: وصلاةٍ.
en_gb: Prayer

source: وصُفْرةِ أسْنَانٍ.
en_gb: On yellowing of the teeth

source: وطهارةُ عَيْنِهِمَا.
en_gb: They are pure (in themselves)

source: وعدم القدرة على استعمال الماء.
en_gb: Inability to use water

source: وعدمُ وصْفِهِمَا البَشَرةَ.
en_gb: They do not describe the skin beneath due to being thin

source: وعن الإمام أحمد رواية أخرى: أنه لا يجب في غسل الأنجاس سوى نجاسة الكلب والخنزير -- عدد، واختار هذه الرواية ابن قدامة وابن تيمية وجماعة، اعتمادًا على أنه لم يصح عن النبي ﷺ في ذلك شيء لا من قوله ولا من فعله، ويدل عليه ما أخرجه الإمام أحمد في «المسند» (2/309) عن ابن عمر رضي الله عنه قال: كانت الصلاة خمسين، والغسل من الجنابة سبع مرار، وغسل الثوب من البول سبع مرار، ولم يزل رسول الله ﷺ يسأل حتى كانت الصلاة خمسًا، والغُسل من الجنابة، وغَسل الثوب مرة.» وهذه الرواية أسعدُ دليلًا، وأقربُ إلى مقاصِدِ الشريعة العامةِ -- والله أعلم.
en_gb: Imam Aḥmad has a another narration regarding this; that it is not _wājib_ (compulsory) to wash _najāsah_ multiple times except the _najāsah_ of dogs and pigs. Ibn Qudāmah, Ibn Taymīyah, and some other scholars preferred this opinion, relying on the fact that there is nothing authentic from the sayings or actions of the Prophet regarding this. This was also alluded to by what Imam Aḥmad collected in his _al-Musnad_ (2/309): the narration of Ibn ʿUmar \FPTWO who said, “The _ṣalāh_ used to be 50 [times a day], _ghusl_ from _janābah_ was seven times, purifying clothes from urine was seven times. The Messenger of Allāh \FPBUH kept on asking until the _ṣalāh_ became 5 [times a day], and _ghusl_ from _janābah_ and cleaning clothes one time.” This narration is the (asʿad?) evidence and closest to the general objectives of the Sharīʿah -- Allāh knows best.

source: وغَسلُ الميّتِ أَوْ بعضِهِ.
en_gb: Giving _ghusl_ to the dead or washing some part of him.

source: وغَسْلُ الكفينِ ثلاثًا، لغيرِ قائمٍ من نَوْمِ ليلٍ، فيجب بنية وتسمية - كما تقدم.
en_gb: Washing the hands thrice. For those waking up from night's sleep, intention and _basmalah_ is required, as has preceded.

source: وفوائدُهُ كثيرةٌ، منها:
en_gb: It has many benefits, from them are:

source: وفي شَقٍّ.
en_gb: Urinate in a crack.

source: وقراءةُ سورةِ القدرِ.
en_gb: The recitation of Sūrah al-Qadr.

source: وقراءةِ قُرآنِ
en_gb: Recitation of Quran

source: وقصُّ الأظافِرِ.
en_gb: Clip the nails

source: وقولُ ما وردَ بعد فراغه وهو: «أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله، اللهم اجعلني من التوابين، واجعلني من عبادك المتطهرين»[^ف1] مع رفع بصره إلى السماء.
en_gb: And to say after its completion what has been narrated, and that is “I bear witness that there is no deity (worthy of worship) except Allāh alone without any partnet and I bear witness that Muḥammad is his slave and messenger. O Allāh, make me from the repentful and from your (purifying/purified?) slaves.”[^fn1] along with directing the sight to the sky.

source: وكل ميتةٍ نجسةٌ إِلَّا:
en_gb: Every carcass is _najas_: except

source: وكلُّ ما أوجبَ الغُسْلَ أوجبَ الوضوءَ إلَّا الموتُ.[^ف2]
en_gb: Everything that mandates ghusl, mandates _wuḍūʾ_, except death.[^fn-1]

source: ولإحرامٍ.
en_gb: For [entering the state of] _iḥrām_.

source: ولا محترق.
en_gb: that is not burnt

source: ولاستحاضة لكل صلاةٍ.
en_gb: And due to _istiḥāḍah_ for every prayer.

source: ولجنونٍ.
en_gb: For insanity.

source: ولدخول مكةَ – ولو مع حيضٍ -.
en_gb: For entering Makkah, even if menstruating --

source: ولدخولِ حرمها.
en_gb: And for entering its _ḥaram_ (sanctuary).

source: ولرمي جِمارٍ.[^ف5]
en_gb: For the throwing at the Jamarāt.[^fn5]

source: ولصلاةِ عيد في يَوْمِهِ.
en_gb: For the Eid prayer on its very day.

source: ولصلاۃِ كُسوفٍ.
en_gb: For the Eclipse prayer (Kusūf)

source: ولطوافِ زیارةٍ.
en_gb: For ṭawāf al-ziyārah.

source: ولطوافِ وَدَاعٍ.
en_gb: For ṭawāf al-wadāʿ (farewell ṭawāf).

source: ولم أَجد دليلًا عليها.
en_gb: I could not find any evidence for it.

source: ولمبيتٍ بمزدلفة.
en_gb: For staying the night at Muzdalifah.

source: ولمسُ الذَّكرِ بشَرَةَ الأُنْثىٰ، والأُنْثىٰ بِشَرَةِ الذَّكرِ بِشَهْوَةٍ، ولو كان الملموسُ مَيْتًا أَوْ عجُوزًا أَوْ مَحْرَمًا.
en_gb: The touching of female skin by a male and male skin by a female with (sexual) desire, even if the one touched is a corpse, and old person, or a _maḥram_.

source: ولوقوفٍ بعَرَفَة.
en_gb: For the standing at ʿArafah.

source: وما دونها كالفأرة طاهر.
en_gb: But whatever are smaller than than that, such as mice, are _ṭāhir_.

source: وما لا دمَ له سائلٌ، كالعَقْربِ[^ف3].
en_gb: Whatever doesn't have flowing blood, such as scorpions.[^fn-3]
